#+TITLE: Java Programming in Emacs
** Environment Setup
In some operating systems Emacs does not load environment variables properly. Therefore, below we install a package called ~exec-path-from-shell~ and initialize it.
 #+begin_src emacs-lisp
 (use-package exec-path-from-shell :ensure t)
 (exec-path-from-shell-initialize)
 #+end_src

 #+RESULTS:
 : ((MANPATH . /usr/share/man:/usr/local/share/man) (PATH . /usr/local/opt/openjdk/bin:/usr/local/opt/openssl/bin:/usr/local/opt/curl/bin:/usr/local/opt/gettext/bin:/Users/khoa.nguyen/.vim/pack/junegunn/start/fzf/bin:usr/local/opt/ncurses/bin:/Users/khoa.nguyen/go/bin:/usr/local/mysql/bin:/Users/khoa.nguyen/Library/Python/3.8/bin:/Users/khoa.nguyen/scripts/:/Users/khoa.nguyen/.nix-profile/bin:/nix/var/nix/profiles/default/bin:/usr/local/bin:/usr/bin:/bin:/usr/sbin:/sbin:/Applications/VMware Fusion.app/Contents/Public:/usr/local/opt/openjdk/bin:/usr/local/opt/openssl/bin:/usr/local/opt/curl/bin:/usr/local/opt/gettext/bin:/Users/khoa.nguyen/.vim/pack/junegunn/start/fzf/bin:usr/local/opt/ncurses/bin:/Users/khoa.nguyen/go/bin:/usr/local/mysql/bin:/Users/khoa.nguyen/Library/Python/3.8/bin:/Users/khoa.nguyen/scripts/:/Users/khoa.nguyen/.nix-profile/bin:/nix/var/nix/profiles/default/bin:/Applications/Emacs.app/Contents/MacOS/bin-x86_64-10_14:/Applications/Emacs.app/Contents/MacOS/libexec-x86_64-10_14:/Users/khoa.nguyen/.fzf/bin:/Users/khoa.nguyen/Library/Python/3.9/bin:/Users/khoa.nguyen/Library/Python/2.7/bin:/Applications/nvim-osx64/bin:/Users/khoa.nguyen/Library/Python/3.9/bin:/Users/khoa.nguyen/Library/Python/2.7/bin:/Applications/nvim-osx64/bin))
 
** Marginalia
#+begin_src emacs-lisp
	(use-package marginalia
	;; Either bind `marginalia-cycle` globally or only in the minibuffer
	:bind (("M-A" . marginalia-cycle)
		   :map minibuffer-local-map
		   ("M-A" . marginalia-cycle))

	;; The :init configuration is always executed (Not lazy!)
	:init

	;; Must be in the :init section of use-package such that the mode gets
	;; enabled right away. Note that this forces loading the package.
	(marginalia-mode))

  (setq default-frame-alist '((font . "Ubuntu Mono-14")))
#+end_src

#+RESULTS:
: ((font . Ubuntu Mono-14))

** Install LSP Package
Let's install the main package for lsp. Here we will integrate lsp with which-key. This way, when we type the prefix key ~C-c l~ we get additional help for compliting the command. 

#+begin_src emacs-lisp
  (use-package lsp-mode
	:ensure t

	:hook (
		   (lsp-mode . lsp-enable-which-key-integration)
		   (java-mode . lsp-deferred)
		   (go-mode . lsp-deferred)
		   (c++-mode . 'lsp-deferred)
		   )
	:init (setq 
		   lsp-keymap-prefix "C-c l"              ; this is for which-key integration documentation, need to use lsp-mode-map
		   lsp-enable-file-watchers nil
		   read-process-output-max (* 1024 1024)  ; 1 mb
		   lsp-completion-provider :capf
		   lsp-idle-delay 0.500
		   )
	:config 
	;; (setq lsp-intelephense-multi-root nil) ; don't scan unnecessary projects
	;; (with-eval-after-load 'lsp-intelephense
	;; 	(setf (lsp--client-multi-root (gethash 'iph lsp-clients)) nil))
	(define-key lsp-mode-map (kbd "C-c l") lsp-command-map)
	:commands (lsp lsp-deferred)
	)
#+end_src

#+RESULTS:
| lsp-mode |

You can start LSP server in a java project by using ~C-c l s s~. Once you type ~C-c l~ ~which-key~ package should guide you through rest of the options. In above setting I have added some memory management settings as suggested in [[https://emacs-lsp.github.io/lsp-mode/page/performance/][this guide]]. Change them to higher numbers, if you find *lsp-mode* sluggish in your computer.

